//
//  MRTransformLabel.m
//  MongolianReadProject
//
//  Created by 张祎 on 2017/5/24.
//  Copyright © 2017年 张祎. All rights reserved.
//

#import "MRTransformLabel.h"
#import "Masonry.h"

@interface MRTransformLabel ()
@property (nonatomic, assign) MRTransformLabelFontType type;
@end

@implementation MRTransformLabel

- (instancetype)initWithFrame:(CGRect)frame type:(MRTransformLabelFontType)type {
    self = [super initWithFrame:frame];
    if (self) {
        
        switch (type) {
            case Vertical: {
                
                _type = type;
                self.transform = CGAffineTransformMakeRotation(M_PI_2);
                self.font = [UIFont fontWithName:@"MongolianWhite" size:14];
                self.frame = frame;
            }
                break;
            case Mirror: {
                
                _type = type;
                self.layer.transform = CATransform3DRotate(CATransform3DMakeRotation(M_PI_2, 0, 0, 1), M_PI, 1, 0, 0);
                self.font = [UIFont fontWithName:@"MongolianWhiteMirrored" size:14];
            }
                break;
                
            default:
                break;
        }
    }
    return self;
}

- (void)setFontWithSize:(CGFloat)size {
    if (self.type == Vertical) {
        self.font = [UIFont fontWithName:@"MongolianWhite" size:size];
    }
    
    else if (self.type == Mirror) {
        self.font = [UIFont fontWithName:@"MongolianWhiteMirrored" size:size];
    }
    
    else {
        NSAssert(NO, @"未知文本类型");
    }
}

+ (NSString *)autoMonString {
    
//    NSString *longStr = @"";
//    
//    for (NSInteger i = 0; i < 10; i++) {
//        longStr = [NSString stringWithFormat:@"%@%@", longStr, @"ᠰᠢ ᠵᠢᠨ ᠫᠢᠩ ᠶᠡᠷᠦᠩᠬᠡᠢ ᠱᠦᠵᠢ ᠶᠢᠨ ᠶᠠᠷᠢᠶᠠᠨ ᠤ ᠵᠤᠷᠢᠭ ᠰᠠᠨᠠᠭ᠎ᠠ ᠶᠢ ᠲᠤᠤᠱᠯᠠᠭᠤᠯᠵᠤ ᠨᠠᠶᠢᠳᠠᠪᠤᠷᠢᠵᠢᠭᠤᠯᠬᠤ ᠪᠠ ᠴᠡᠷᠢᠭ ᠪᠠᠶᠢᠭᠤᠯᠤᠭᠳᠠᠭᠰᠠᠨ 90 ᠵᠢᠯ ᠤᠨ ᠤᠢ  ᠶᠢ ᠪᠡᠯᠭᠡᠯᠡᠬᠦ ᠶᠢᠨ ᠲᠦᠯᠦᠭᠡ 7 ᠰᠠᠷ᠎ᠠ ᠶᠢᠨ ᠳᠤᠮᠳᠠᠴᠢ ᠡᠴᠡ 8 ᠰᠠᠷ᠎ᠠ ᠶᠢᠨ ᠡᠬᠢᠨ ᠪᠤᠯᠲᠠᠯ᠎ᠠ᠂ ᠲᠦᠪ ᠤᠨ ᠴᠡᠷᠢᠭ᠌ ᠤᠨ ᠶᠠᠪᠤᠳᠠᠯ ᠤᠨ ᠬᠤᠷᠢᠶᠠᠨ ᠤ ᠤᠯᠤᠰ ᠲᠦᠷᠦ ᠶᠢᠨ ᠠᠵᠢᠯ ᠤᠨ ᠬᠡᠯᠲᠡᠰ᠂ ᠲᠦᠪ ᠤᠨ ᠨᠸᠲ ᠤᠨ ᠠᠶᠤᠯᠭᠦᠢ ᠪᠤᠯᠤᠨ ᠰᠤᠷᠠᠭ ᠵᠠᠩᠭᠢᠴᠢᠯᠠᠭᠰᠠᠨ ᠤᠳᠤᠷᠢᠳᠬᠤ ᠪᠠ"];
//    }
//    
//    return longStr;
    
//    return @"我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游我的家在东北松花江上游231231我的家在东北松花江上游2131211112";

    
    
    return @"ᠰᠢ ᠵᠢᠨ ᠫᠢᠩ ᠶᠡᠷᠦᠩᠬᠡᠢ ᠱᠦᠵᠢ ᠶᠢᠨ ᠶᠠᠷᠢᠶᠠᠨ ᠤ ᠵᠤᠷᠢᠭ ᠰᠠᠨᠠᠭ᠎ᠠ ᠶᠢ ᠲᠤᠤᠱᠯᠠᠭᠤᠯᠵᠤ ᠨᠠᠶᠢᠳᠠᠪᠤᠷᠢᠵᠢᠭᠤᠯᠬᠤ ᠪᠠ ᠴᠡᠷᠢᠭ ᠪᠠᠶᠢᠭᠤᠯᠤᠭᠳᠠᠭᠰᠠᠨ 90 ᠵᠢᠯ ᠤᠨ ᠤᠢ  ᠶᠢ ᠪᠡᠯᠭᠡᠯᠡᠬᠦ ᠶᠢᠨ ᠲᠦᠯᠦᠭᠡ 7 ᠰᠠᠷ᠎ᠠ ᠶᠢᠨ ᠳᠤᠮᠳᠠᠴᠢ ᠡᠴᠡ 8 ᠰᠠᠷ᠎ᠠ ᠶᠢᠨ ᠡᠬᠢᠨ ᠪᠤᠯᠲᠠᠯ᠎ᠠ᠂ ᠲᠦᠪ ᠤᠨ ᠴᠡᠷᠢᠭ᠌ ᠤᠨ ᠶᠠᠪᠤᠳᠠᠯ ᠤᠨ ᠬᠤᠷᠢᠶᠠᠨ ᠤ ᠤᠯᠤᠰ ᠲᠦᠷᠦ ᠶᠢᠨ ᠠᠵᠢᠯ ᠤᠨ ᠬᠡᠯᠲᠡᠰ᠂ ᠲᠦᠪ ᠤᠨ ᠨᠸᠲ ᠤᠨ ᠠᠶᠤᠯᠭᠦᠢ ᠪᠤᠯᠤᠨ ᠰᠤᠷᠠᠭ ᠵᠠᠩᠭᠢᠴᠢᠯᠠᠭᠰᠠᠨ ᠤᠳᠤᠷᠢᠳᠬᠤ ᠪᠰᠢ ᠵᠢᠨ ᠫᠢᠩ ᠶᠡᠷᠦᠩᠬᠡᠢ ᠱᠦᠵᠢ ᠶᠢᠨ ᠶᠠᠷᠢᠶᠠᠨ ᠤ ᠵᠤᠷᠢᠭ ᠰᠠᠨᠠᠭ᠎ᠠ ᠶᠢ ᠲᠤᠤᠱᠯᠠᠭᠤᠯᠵᠤ ᠨᠠᠶᠢᠳᠠᠪᠤᠷᠢᠵᠢᠭᠤᠯᠬᠤ ᠪᠠ ᠴᠡᠷᠢᠭ ᠪᠠᠶᠢᠭᠤᠯᠤᠭᠳᠠᠭᠰᠠᠨ 90 ᠵᠢᠯ ᠤᠨ ᠤᠢ  ᠶᠢ ᠪᠡᠯᠭᠡᠯᠡᠬᠦ ᠶᠢᠨ ᠲᠦᠯᠦᠭᠡ 7 ᠰᠠᠷ᠎ᠠ ᠶᠢᠨ ᠳᠤᠮᠳᠠᠴᠢ ᠡᠴᠡ 8 ᠰᠠᠷ᠎ᠠ ᠶᠢᠨ ᠡᠬᠢᠨ ᠪᠤᠯᠲᠠᠯ᠎ᠠ᠂ ᠲᠦᠪ ᠤᠨ ᠴᠡᠷᠢᠭ᠌ ᠤᠨ ᠶᠠᠪᠤᠳᠠᠯ ᠤᠨ ᠬᠤᠷᠢᠶᠠᠨ ᠤ ᠤᠯᠤᠰ ᠲᠦᠷᠦ ᠶᠢᠨ ᠠᠵᠢᠯ ᠤᠨ ᠬᠡᠯᠲᠡᠰ᠂ ᠲᠦᠪ ᠤᠨ ᠨᠸᠲ ᠤᠨ ᠠᠶᠤᠯᠭᠦᠢ ᠪᠤᠯᠤᠨ ᠰᠤᠷᠠᠭ ᠵᠠᠩᠭᠢᠴᠢᠯᠠᠭᠰᠠᠨ ᠤᠳᠤᠷᠢᠳᠬᠤ ᠪᠰᠢ ᠵᠢᠨ ᠫᠢᠩ ᠶᠡᠷᠦᠩᠬᠡᠢ ᠱᠦᠵᠢ ᠶᠢᠨ ᠶᠠᠷᠢᠶᠠᠨ ᠤ ᠵᠤᠷᠢᠭ ᠰᠠᠨᠠᠭ᠎ᠠ ᠶᠢ ᠲᠤᠤᠱᠯᠠᠭᠤᠯᠵᠤ ᠨᠠᠶᠢᠳᠠᠪᠤᠷᠢᠵᠢᠭᠤᠯᠬᠤ ᠪᠠ ᠴᠡᠷᠢᠭ ᠪᠠᠶᠢᠭᠤᠯᠤᠭᠳᠠᠭᠰᠠᠨ 90 ᠵᠢᠯ ᠤᠨ ᠤᠢ  ᠶᠢ ᠪᠡᠯᠭᠡᠯᠡᠬᠦ ᠶᠢᠨ ᠲᠦᠯᠦᠭᠡ 7 ᠰᠠᠷ᠎ᠠ ᠶᠢᠨ ᠳᠤᠮᠳᠠᠴᠢ ᠡᠴᠡ 8 ᠰᠠᠷ᠎ᠠ ᠶᠢᠨ ᠡᠬᠢᠨ ᠪᠤᠯᠲᠠᠯ᠎ᠠ᠂ ᠲᠦᠪ ᠤᠨ ᠴᠡᠷᠢᠭ᠌ ᠤᠨ ᠶᠠᠪᠤᠳᠠᠯ ᠤᠨ ᠬᠤᠷᠢᠶᠠᠨ ᠤ ᠤᠯᠤᠰ ᠲᠦᠷᠦ ᠶᠢᠨ ᠠᠵᠢᠯ ᠤᠨ ᠬᠡᠯᠲᠡᠰ᠂ ᠲᠦᠪ ᠤᠨ ᠨᠸᠲ ᠤᠨ ᠠᠶᠤᠯᠭᠦᠢ ᠪᠤᠯᠤᠨ ᠰᠤᠷᠠᠭ ᠵᠠᠩᠭᠢᠴᠢᠯᠠᠭᠰᠠᠨ ᠤᠳᠤᠷᠢᠳᠬᠤ ᠪᠰᠢ ᠵᠢᠨ ᠫᠢᠩ ᠶᠡᠷᠦᠩᠬᠡᠢ ᠱᠦᠵᠢ ᠶᠢᠨ ᠶᠠᠷᠢᠶᠠᠨ ᠤ ᠵᠤᠷᠢᠭ ᠰᠠᠨᠠᠭ᠎ᠠ ᠶᠢ ᠲᠤᠤᠱᠯᠠᠭᠤᠯᠵᠤ ᠨᠠᠶᠢᠳᠠᠪᠤᠷᠢᠵᠢᠭᠤᠯᠬᠤ ᠪᠠ ᠴᠡᠷᠢᠭ ᠪᠠᠶᠢᠭᠤᠯᠤᠭᠳᠠᠭᠰᠠᠨ 90 ᠵᠢᠯ ᠤᠨ ᠤᠢ  ᠶᠢ ᠪᠡᠯᠭᠡᠯᠡᠬᠦ ᠶᠢᠨ ᠲᠦᠯᠦᠭᠡ 7 ᠰᠠᠷ᠎ᠠ ᠶᠢᠨ ᠳᠤᠮᠳᠠᠴᠢ ᠡᠴᠡ 8 ᠰᠠᠷ᠎ᠠ ᠶᠢᠨ ᠡᠬᠢᠨ ᠪᠤᠯᠲᠠᠯ᠎ᠠ᠂ ᠲᠦᠪ ᠤᠨ ᠴᠡᠷᠢᠭ᠌ ᠤᠨ ᠶᠠᠪᠤᠳᠠᠯ ᠤᠨ ᠬᠤᠷᠢᠶᠠᠨ ᠤ ᠤᠯᠤᠰ ᠲᠦᠷᠦ ᠶᠢᠨ ᠠᠵᠢᠯ ᠤᠨ ᠬᠡᠯᠲᠡᠰ᠂ ᠲᠦᠪ ᠤᠨ ᠨᠸᠲ ᠤᠨ ᠠᠶᠤᠯᠭᠦᠢ ᠪᠤᠯᠤᠨ ᠰᠤᠷᠠᠭ ᠵᠠᠩᠭᠢᠴᠢᠯᠠᠭᠰᠠᠨ ᠤᠳᠤᠷᠢᠳᠬᠤ ᠪᠰᠢ ᠵᠢᠨ ᠫᠢᠩ ᠶᠡᠷᠦᠩᠬᠡᠢ ᠱᠦᠵᠢ ᠶᠢᠨ ᠶᠠᠷᠢᠶᠠᠨ ᠤ ᠵᠤᠷᠢᠭ ᠰᠠᠨᠠᠭ᠎ᠠ ᠶᠢ ᠲᠤᠤᠱᠯᠠᠭᠤᠯᠵᠤ ᠨᠠᠶᠢᠳᠠᠪᠤᠷᠢᠵᠢᠭᠤᠯᠬᠤ ᠪᠠ ᠴᠡᠷᠢᠭ ᠪᠠᠶᠢᠭᠤᠯᠤᠭᠳᠠᠭᠰᠠᠨ 90 ᠵᠢᠯ ᠤᠨ ᠤᠢ  ᠶᠢ ᠪᠡᠯᠭᠡᠯᠡᠬᠦ ᠶᠢᠨ ᠲᠦᠯᠦᠭᠡ 7 ᠰᠠᠷ᠎ᠠ ᠶᠢᠨ ᠳᠤᠮᠳᠠᠴᠢ ᠡᠴᠡ 8 ᠰᠠᠷ᠎ᠠ ᠶᠢᠨ ᠡᠬᠢᠨ ᠪᠤᠯᠲᠠᠯ᠎ᠠ᠂ ᠲᠦᠪ ᠤᠨ ᠴᠡᠷᠢᠭ᠌ ᠤᠨ ᠶᠠᠪᠤᠳᠠᠯ ᠤᠨ ᠬᠤᠷᠢᠶᠠᠨ ᠤ ᠤᠯᠤᠰ ᠲᠦᠷᠦ ᠶᠢᠨ ᠠᠵᠢᠯ ᠤᠨ ᠬᠡᠯᠲᠡᠰ᠂ ᠲᠦᠪ ᠤᠨ ᠨᠸᠲ ᠤᠨ ᠠᠶᠤᠯᠭᠦᠢ ᠪᠤᠯᠤᠨ ᠰᠤᠷᠠᠭ ᠵᠠᠩᠭᠢᠴᠢᠯᠠᠭᠰᠠᠨ ᠤᠳᠤᠷᠢᠳᠬᠤ ᠪᠰᠢ ᠵᠢᠨ ᠫᠢᠩ ᠶᠡᠷᠦᠩᠬᠡᠢ ᠱᠦᠵᠢ ᠶᠢᠨ ᠶᠠᠷᠢᠶᠠᠨ ᠤ ᠵᠤᠷᠢᠭ ᠰᠠᠨᠠᠭ᠎ᠠ ᠶᠢ ᠲᠤᠤᠱᠯᠠᠭᠤᠯᠵᠤ ᠨᠠᠶᠢᠳᠠᠪᠤᠷᠢᠵᠢᠭᠤᠯᠬᠤ ᠪᠠ ᠴᠡᠷᠢᠭ ᠪᠠᠶᠢᠭᠤᠯᠤᠭᠳᠠᠭᠰᠠᠨ 90 ᠵᠢᠯ ᠤᠨ ᠤᠢ  ᠶᠢ ᠪᠡᠯᠭᠡᠯᠡᠬᠦ ᠶᠢᠨ ᠲᠦᠯᠦᠭᠡ 7 ᠰᠠᠷ᠎ᠠ ᠶᠢᠨ ᠳᠤᠮᠳᠠᠴᠢ ᠡᠴᠡ 8 ᠰᠠᠷ᠎ᠠ ᠶᠢᠨ ᠡᠬᠢᠨ ᠪᠤᠯᠲᠠᠯ᠎ᠠ᠂ ᠲᠦᠪ ᠤᠨ ᠴᠡᠷᠢᠭ᠌ ᠤᠨ ᠶᠠᠪᠤᠳᠠᠯ ᠤᠨ ᠬᠤᠷᠢᠶᠠᠨ ᠤ ᠤᠯᠤᠰ ᠲᠦᠷᠦ ᠶᠢᠨ ᠠᠵᠢᠯ ᠤᠨ ᠬᠡᠯᠲᠡᠰ᠂ ᠲᠦᠪ ᠤᠨ ᠨᠸᠲ ᠤᠨ ᠠᠶᠤᠯᠭᠦᠢ ᠪᠤᠯᠤᠨ ᠰᠤᠷᠠᠭ ᠵᠠᠩᠭᠢᠴᠢᠯᠠᠭᠰᠠᠨ ᠤᠳᠤᠷᠢᠳᠬᠤ ᠪᠰᠢ ᠵᠢᠨ ᠫᠢᠩ ᠶᠡᠷᠦᠩᠬᠡᠢ ᠱᠦᠵᠢ ᠶᠢᠨ ᠶᠠᠷᠢᠶᠠᠨ ᠤ ᠵᠤᠷᠢᠭ ᠰᠠᠨᠠᠭ᠎ᠠ ᠶᠢ ᠲᠤᠤᠱᠯᠠᠭᠤᠯᠵᠤ ᠨᠠᠶᠢᠳᠠᠪᠤᠷᠢᠵᠢᠭᠤᠯᠬᠤ ᠪᠠ ᠴᠡᠷᠢᠭ ᠪᠠᠶᠢᠭᠤᠯᠤᠭᠳᠠᠭᠰᠠᠨ 90 ᠵᠢᠯ ᠤᠨ ᠤᠢ  ᠶᠢ ᠪᠡᠯᠭᠡᠯᠡᠬᠦ ᠶᠢᠨ ᠲᠦᠯᠦᠭᠡ 7 ᠰᠠᠷ᠎ᠠ ᠶᠢᠨ ᠳᠤᠮᠳᠠᠴᠢ ᠡᠴᠡ 8 ᠰᠠᠷ᠎ᠠ ᠶᠢᠨ ᠡᠬᠢᠨ ᠪᠤᠯᠲᠠᠯ᠎ᠠ᠂ ᠲᠦᠪ ᠤᠨ ᠴᠡᠷᠢᠭ᠌ ᠤᠨ ᠶᠠᠪᠤᠳᠠᠯ ᠤᠨ ᠬᠤᠷᠢᠶᠠᠨ ᠤ ᠤᠯᠤᠰ ᠲᠦᠷᠦ ᠶᠢᠨ ᠠᠵᠢᠯ ᠤᠨ ᠬᠡᠯᠲᠡᠰ᠂ ᠲᠦᠪ ᠤᠨ ᠨᠸᠲ ᠤᠨ ᠠᠶᠤᠯᠭᠦᠢ ᠪᠤᠯᠤᠨ ᠰᠤᠷᠠᠭ ᠵᠠᠩᠭᠢᠴᠢᠯᠠᠭᠰᠠᠨ ᠤᠳᠤᠷᠢᠳᠬᠤ ᠪᠰᠢ ᠵᠢᠨ ᠫᠢᠩ ᠶᠡᠷᠦᠩᠬᠡᠢ ᠱᠦᠵᠢ ᠶᠢᠨ ᠶᠠᠷᠢᠶᠠᠨ ᠤ ᠵᠤᠷᠢᠭ ᠰᠠᠨᠠᠭ᠎ᠠ ᠶᠢ ᠲᠤᠤᠱᠯᠠᠭᠤᠯᠵᠤ ᠨᠠᠶᠢᠳᠠᠪᠤᠷᠢᠵᠢᠭᠤᠯᠬᠤ ᠪᠠ ᠴᠡᠷᠢᠭ ᠪᠠᠶᠢᠭᠤᠯᠤᠭᠳᠠᠭᠰᠠᠨ 90 ᠵᠢᠯ ᠤᠨ ᠤᠢ  ᠶᠢ ᠪᠡᠯᠭᠡᠯᠡᠬᠦ ᠶᠢᠨ ᠲᠦᠯᠦᠭᠡ 7 ᠰᠠᠷ᠎ᠠ ᠶᠢᠨ ᠳᠤᠮᠳᠠᠴᠢ ᠡᠴᠡ 8 ᠰᠠᠷ᠎ᠠ ᠶᠢᠨ ᠡᠬᠢᠨ ᠪᠤᠯᠲᠠᠯ᠎ᠠ᠂ ᠲᠦᠪ ᠤᠨ ᠴᠡᠷᠢᠭ᠌ ᠤᠨ ᠶᠠᠪᠤᠳᠠᠯ ᠤᠨ ᠬᠤᠷᠢᠶᠠᠨ ᠤ ᠤᠯᠤᠰ ᠲᠦᠷᠦ ᠶᠢᠨ ᠠᠵᠢᠯ ᠤᠨ ᠬᠡᠯᠲᠡᠰ᠂ ᠲᠦᠪ ᠤᠨ ᠨᠸᠲ ᠤᠨ ᠠᠶᠤᠯᠭᠦᠢ ᠪᠤᠯᠤᠨ ᠰᠤᠷᠠᠭ ᠵᠠᠩᠭᠢᠴᠢᠯᠠᠭᠰᠠᠨ ᠤᠳᠤᠷᠢᠳᠬᠤ ᠪᠠ";
    
    return @"ᠰᠢ ᠵᠢᠨ ᠫᠢᠩ ᠶᠡᠷᠦᠩᠬᠡᠢ ᠱᠦᠵᠢ ᠶᠢᠨ ᠶᠠᠷᠢᠶᠠᠨ ᠤ ᠵᠤᠷᠢᠭ ᠰᠠᠨᠠᠭ᠎ᠠ ᠶᠢ ᠲᠤᠤᠱᠯᠠᠭᠤᠯᠵᠤ ᠨᠠᠶᠢᠳᠠᠪᠤᠷᠢᠵᠢᠭᠤᠯᠬᠤ ᠪᠠ ᠴᠡᠷᠢᠭ ᠪᠠᠶᠢᠭᠤᠯᠤᠭᠳᠠᠭᠰᠠᠨ 90 ᠵᠢᠯ ᠤᠨ ᠤᠢ  ᠶᠢ ᠪᠡᠯᠭᠡᠯᠡᠬᠦ ᠶᠢᠨ ᠲᠦᠯᠦᠭᠡ 7 ᠰᠠᠷ᠎ᠠ ᠶᠢᠨ ᠳᠤᠮᠳᠠᠴᠢ ᠡᠴᠡ 8 ᠰᠠᠷ᠎ᠠ ᠶᠢᠨ ᠡᠬᠢᠨ ᠪᠤᠯᠲᠠᠯ᠎ᠠ᠂ ᠲᠦᠪ ᠤᠨ ᠴᠡᠷᠢᠭ᠌ ᠤᠨ ᠶᠠᠪᠤᠳᠠᠯ ᠤᠨ ᠬᠤᠷᠢᠶᠠᠨ ᠤ ᠤᠯᠤᠰ ᠲᠦᠷᠦ ᠶᠢᠨ ᠠᠵᠢᠯ ᠤᠨ ᠬᠡᠯᠲᠡᠰ᠂ ᠲᠦᠪ ᠤᠨ ᠨᠸᠲ ᠤᠨ ᠠᠶᠤᠯᠭᠦᠢ ᠪᠤᠯᠤᠨ ᠰᠤᠷᠠᠭ ᠵᠠᠩᠭᠢᠴᠢᠯᠠᠭᠰᠠᠨ ᠤᠳᠤᠷᠢᠳᠬᠤ ᠪᠠ";
}

- (void)autoLayout {
    
    UIView *superView = [self superview];
    
    [self mas_makeConstraints:^(MASConstraintMaker *make) {
        make.centerX.equalTo(superView);
        make.centerY.equalTo(superView);
        make.width.equalTo(superView.mas_height);
        make.height.equalTo(superView.mas_width);
    }];
}

- (void)setFontSize:(NSInteger)fontSize {
    [self setFontWithSize:fontSize];
}
/*
 // Only override drawRect: if you perform custom drawing.
 // An empty implementation adversely affects performance during animation.
 - (void)drawRect:(CGRect)rect {
 // Drawing code
 }
 */

@end
